MikroElektronika/core_packages/PIC/XC8/def/PIC18LF6493/mcu.h
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0xF71);
// bitfield macros
#define _LCDDATA12_LCDDATA12_POSN                           0x0
#define _LCDDATA12_LCDDATA12_POSITION                       0x0
#define _LCDDATA12_LCDDATA12_SIZE                           0x8
#define _LCDDATA12_LCDDATA12_LENGTH                         0x8
#define _LCDDATA12_LCDDATA12_MASK                           0xFF
#define _LCDDATA12_S0C2_POSN                                0x0
#define _LCDDATA12_S0C2_POSITION                            0x0
#define _LCDDATA12_S0C2_SIZE                                0x1
#define _LCDDATA12_S0C2_LENGTH                              0x1
#define _LCDDATA12_S0C2_MASK                                0x1
#define _LCDDATA12_S1C2_POSN                                0x1
#define _LCDDATA12_S1C2_POSITION                            0x1
#define _LCDDATA12_S1C2_SIZE                                0x1
#define _LCDDATA12_S1C2_LENGTH                              0x1
#define _LCDDATA12_S1C2_MASK                                0x2
#define _LCDDATA12_S2C2_POSN                                0x2
#define _LCDDATA12_S2C2_POSITION                            0x2
#define _LCDDATA12_S2C2_SIZE                                0x1
#define _LCDDATA12_S2C2_LENGTH                              0x1
#define _LCDDATA12_S2C2_MASK                                0x4
#define _LCDDATA12_S3C2_POSN                                0x3
#define _LCDDATA12_S3C2_POSITION                            0x3
#define _LCDDATA12_S3C2_SIZE                                0x1
#define _LCDDATA12_S3C2_LENGTH                              0x1
#define _LCDDATA12_S3C2_MASK                                0x8
#define _LCDDATA12_S4C2_POSN                                0x4
#define _LCDDATA12_S4C2_POSITION                            0x4
#define _LCDDATA12_S4C2_SIZE                                0x1
#define _LCDDATA12_S4C2_LENGTH                              0x1
#define _LCDDATA12_S4C2_MASK                                0x10
#define _LCDDATA12_S5C2_POSN                                0x5
#define _LCDDATA12_S5C2_POSITION                            0x5
#define _LCDDATA12_S5C2_SIZE                                0x1
#define _LCDDATA12_S5C2_LENGTH                              0x1
#define _LCDDATA12_S5C2_MASK                                0x20
#define _LCDDATA12_S6C2_POSN                                0x6
#define _LCDDATA12_S6C2_POSITION                            0x6
#define _LCDDATA12_S6C2_SIZE                                0x1
#define _LCDDATA12_S6C2_LENGTH                              0x1
#define _LCDDATA12_S6C2_MASK                                0x40
#define _LCDDATA12_S7C2_POSN                                0x7
#define _LCDDATA12_S7C2_POSITION                            0x7
#define _LCDDATA12_S7C2_SIZE                                0x1
#define _LCDDATA12_S7C2_LENGTH                              0x1
#define _LCDDATA12_S7C2_MASK                                0x80
#define _LCDDATA12_SEG0COM2_POSN                            0x0
#define _LCDDATA12_SEG0COM2_POSITION                        0x0
#define _LCDDATA12_SEG0COM2_SIZE                            0x1
#define _LCDDATA12_SEG0COM2_LENGTH                          0x1
#define _LCDDATA12_SEG0COM2_MASK                            0x1
#define _LCDDATA12_SEG1COM2_POSN                            0x1
#define _LCDDATA12_SEG1COM2_POSITION                        0x1
#define _LCDDATA12_SEG1COM2_SIZE                            0x1
#define _LCDDATA12_SEG1COM2_LENGTH                          0x1
#define _LCDDATA12_SEG1COM2_MASK                            0x2
#define _LCDDATA12_SEG2COM2_POSN                            0x2
#define _LCDDATA12_SEG2COM2_POSITION                        0x2
#define _LCDDATA12_SEG2COM2_SIZE                            0x1
#define _LCDDATA12_SEG2COM2_LENGTH                          0x1
#define _LCDDATA12_SEG2COM2_MASK                            0x4
#define _LCDDATA12_SEG3COM2_POSN                            0x3
#define _LCDDATA12_SEG3COM2_POSITION                        0x3
#define _LCDDATA12_SEG3COM2_SIZE                            0x1
#define _LCDDATA12_SEG3COM2_LENGTH                          0x1
#define _LCDDATA12_SEG3COM2_MASK                            0x8
#define _LCDDATA12_SEG4COM2_POSN                            0x4
#define _LCDDATA12_SEG4COM2_POSITION                        0x4
#define _LCDDATA12_SEG4COM2_SIZE                            0x1
#define _LCDDATA12_SEG4COM2_LENGTH                          0x1
#define _LCDDATA12_SEG4COM2_MASK                            0x10
#define _LCDDATA12_SEG5COM2_POSN                            0x5
#define _LCDDATA12_SEG5COM2_POSITION                        0x5
#define _LCDDATA12_SEG5COM2_SIZE                            0x1
#define _LCDDATA12_SEG5COM2_LENGTH                          0x1
#define _LCDDATA12_SEG5COM2_MASK                            0x20
#define _LCDDATA12_SEG6COM2_POSN                            0x6
#define _LCDDATA12_SEG6COM2_POSITION                        0x6
#define _LCDDATA12_SEG6COM2_SIZE                            0x1
#define _LCDDATA12_SEG6COM2_LENGTH                          0x1
#define _LCDDATA12_SEG6COM2_MASK                            0x40
#define _LCDDATA12_SEG7COM2_POSN                            0x7
#define _LCDDATA12_SEG7COM2_POSITION                        0x7
#define _LCDDATA12_SEG7COM2_SIZE                            0x1
#define _LCDDATA12_SEG7COM2_LENGTH                          0x1
#define _LCDDATA12_SEG7COM2_MASK                            0x80
#define _LCDDATA12_S00C2_POSN                               0x0
#define _LCDDATA12_S00C2_POSITION                           0x0
#define _LCDDATA12_S00C2_SIZE                               0x1
#define _LCDDATA12_S00C2_LENGTH                             0x1
#define _LCDDATA12_S00C2_MASK                               0x1
#define _LCDDATA12_S01C2_POSN                               0x1
#define _LCDDATA12_S01C2_POSITION                           0x1
#define _LCDDATA12_S01C2_SIZE                               0x1
#define _LCDDATA12_S01C2_LENGTH                             0x1
#define _LCDDATA12_S01C2_MASK                               0x2
#define _LCDDATA12_S02C2_POSN                               0x2
#define _LCDDATA12_S02C2_POSITION                           0x2
#define _LCDDATA12_S02C2_SIZE                               0x1
#define _LCDDATA12_S02C2_LENGTH                             0x1
#define _LCDDATA12_S02C2_MASK                               0x4
#define _LCDDATA12_S03C2_POSN                               0x3
#define _LCDDATA12_S03C2_POSITION                           0x3
#define _LCDDATA12_S03C2_SIZE                               0x1
#define _LCDDATA12_S03C2_LENGTH                             0x1
#define _LCDDATA12_S03C2_MASK                               0x8
#define _LCDDATA12_S04C2_POSN                               0x4
#define _LCDDATA12_S04C2_POSITION                           0x4
#define _LCDDATA12_S04C2_SIZE                               0x1
#define _LCDDATA12_S04C2_LENGTH                             0x1
#define _LCDDATA12_S04C2_MASK                               0x10
#define _LCDDATA12_S05C2_POSN                               0x5
#define _LCDDATA12_S05C2_POSITION                           0x5
#define _LCDDATA12_S05C2_SIZE                               0x1
#define _LCDDATA12_S05C2_LENGTH                             0x1
#define _LCDDATA12_S05C2_MASK                               0x20
#define _LCDDATA12_S06C2_POSN                               0x6
#define _LCDDATA12_S06C2_POSITION                           0x6
#define _LCDDATA12_S06C2_SIZE                               0x1
#define _LCDDATA12_S06C2_LENGTH                             0x1
#define _LCDDATA12_S06C2_MASK                               0x40
#define _LCDDATA12_S07C2_POSN                               0x7
#define _LCDDATA12_S07C2_POSITION                           0x7
#define _LCDDATA12_S07C2_SIZE                               0x1
#define _LCDDATA12_S07C2_LENGTH                             0x1
#define _LCDDATA12_S07C2_MASK                               0x80
#define _LCDDATA12_SSPM012_POSN                             0x0
#define _LCDDATA12_SSPM012_POSITION                         0x0
#define _LCDDATA12_SSPM012_SIZE                             0x1
#define _LCDDATA12_SSPM012_LENGTH                           0x1
#define _LCDDATA12_SSPM012_MASK                             0x1
#define _LCDDATA12_SSPM112_POSN                             0x1
#define _LCDDATA12_SSPM112_POSITION                         0x1
#define _LCDDATA12_SSPM112_SIZE                             0x1
#define _LCDDATA12_SSPM112_LENGTH                           0x1
#define _LCDDATA12_SSPM112_MASK                             0x2
#define _LCDDATA12_SSPM212_POSN                             0x2
#define _LCDDATA12_SSPM212_POSITION                         0x2
#define _LCDDATA12_SSPM212_SIZE                             0x1
#define _LCDDATA12_SSPM212_LENGTH                           0x1
#define _LCDDATA12_SSPM212_MASK                             0x4
#define _LCDDATA12_SSPM312_POSN                             0x3
#define _LCDDATA12_SSPM312_POSITION                         0x3
#define _LCDDATA12_SSPM312_SIZE                             0x1
#define _LCDDATA12_SSPM312_LENGTH                           0x1
#define _LCDDATA12_SSPM312_MASK                             0x8

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
extern volatile unsigned char           LCDDATA13           __at(0xF72);
#ifndef _LIB_BUILD
asm("LCDDATA13 equ 0F72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA13              :8;
    };
    struct {
        unsigned S8C2                   :1;
        unsigned S9C2                   :1;
        unsigned S10C2                  :1;
        unsigned S11C2                  :1;
        unsigned S12C2                  :1;
        unsigned S13C2                  :1;
        unsigned S14C2                  :1;
        unsigned S15C2                  :1;
    };
    struct {
        unsigned SEG8COM2               :1;
        unsigned SEG9COM2               :1;
        unsigned SEG10COM2              :1;
        unsigned SEG11COM2              :1;
        unsigned SEG12COM2              :1;
        unsigned SEG13COM2              :1;
        unsigned SEG14COM2              :1;
        unsigned SEG15COM2              :1;
    };
    struct {
        unsigned S08C2                  :1;
        unsigned S09C2                  :1;
    };
} LCDDATA13bits_t;
extern volatile LCDDATA13bits_t LCDDATA13bits __at(0xF72);
// bitfield macros
#define _LCDDATA13_LCDDATA13_POSN                           0x0
#define _LCDDATA13_LCDDATA13_POSITION                       0x0
#define _LCDDATA13_LCDDATA13_SIZE                           0x8
#define _LCDDATA13_LCDDATA13_LENGTH                         0x8
#define _LCDDATA13_LCDDATA13_MASK                           0xFF
#define _LCDDATA13_S8C2_POSN                                0x0
#define _LCDDATA13_S8C2_POSITION                            0x0
#define _LCDDATA13_S8C2_SIZE                                0x1
#define _LCDDATA13_S8C2_LENGTH                              0x1
#define _LCDDATA13_S8C2_MASK                                0x1
#define _LCDDATA13_S9C2_POSN                                0x1
#define _LCDDATA13_S9C2_POSITION                            0x1
#define _LCDDATA13_S9C2_SIZE                                0x1
#define _LCDDATA13_S9C2_LENGTH                              0x1
#define _LCDDATA13_S9C2_MASK                                0x2
#define _LCDDATA13_S10C2_POSN                               0x2
#define _LCDDATA13_S10C2_POSITION                           0x2
#define _LCDDATA13_S10C2_SIZE                               0x1
#define _LCDDATA13_S10C2_LENGTH                             0x1
#define _LCDDATA13_S10C2_MASK                               0x4
#define _LCDDATA13_S11C2_POSN                               0x3
#define _LCDDATA13_S11C2_POSITION                           0x3
#define _LCDDATA13_S11C2_SIZE                               0x1
#define _LCDDATA13_S11C2_LENGTH                             0x1
#define _LCDDATA13_S11C2_MASK                               0x8
#define _LCDDATA13_S12C2_POSN                               0x4
#define _LCDDATA13_S12C2_POSITION                           0x4
#define _LCDDATA13_S12C2_SIZE                               0x1
#define _LCDDATA13_S12C2_LENGTH                             0x1
#define _LCDDATA13_S12C2_MASK                               0x10
#define _LCDDATA13_S13C2_POSN                               0x5
#define _LCDDATA13_S13C2_POSITION                           0x5
#define _LCDDATA13_S13C2_SIZE                               0x1
#define _LCDDATA13_S13C2_LENGTH                             0x1
#define _LCDDATA13_S13C2_MASK                               0x20
#define _LCDDATA13_S14C2_POSN                               0x6
#define _LCDDATA13_S14C2_POSITION                           0x6
#define _LCDDATA13_S14C2_SIZE                               0x1
#define _LCDDATA13_S14C2_LENGTH                             0x1
#define _LCDDATA13_S14C2_MASK                               0x40
#define _LCDDATA13_S15C2_POSN                               0x7
#define _LCDDATA13_S15C2_POSITION                           0x7
#define _LCDDATA13_S15C2_SIZE                               0x1
#define _LCDDATA13_S15C2_LENGTH                             0x1
#define _LCDDATA13_S15C2_MASK                               0x80
#define _LCDDATA13_SEG8COM2_POSN                            0x0
#define _LCDDATA13_SEG8COM2_POSITION                        0x0
#define _LCDDATA13_SEG8COM2_SIZE                            0x1
#define _LCDDATA13_SEG8COM2_LENGTH                          0x1
#define _LCDDATA13_SEG8COM2_MASK                            0x1
#define _LCDDATA13_SEG9COM2_POSN                            0x1
#define _LCDDATA13_SEG9COM2_POSITION                        0x1
#define _LCDDATA13_SEG9COM2_SIZE                            0x1
#define _LCDDATA13_SEG9COM2_LENGTH                          0x1
#define _LCDDATA13_SEG9COM2_MASK                            0x2
#define _LCDDATA13_SEG10COM2_POSN                           0x2
#define _LCDDATA13_SEG10COM2_POSITION                       0x2
#define _LCDDATA13_SEG10COM2_SIZE                           0x1
#define _LCDDATA13_SEG10COM2_LENGTH                         0x1
#define _LCDDATA13_SEG10COM2_MASK                           0x4
#define _LCDDATA13_SEG11COM2_POSN                           0x3
#define _LCDDATA13_SEG11COM2_POSITION                       0x3
#define _LCDDATA13_SEG11COM2_SIZE                           0x1
#define _LCDDATA13_SEG11COM2_LENGTH                         0x1
#define _LCDDATA13_SEG11COM2_MASK                           0x8
#define _LCDDATA13_SEG12COM2_POSN                           0x4
#define _LCDDATA13_SEG12COM2_POSITION                       0x4
#define _LCDDATA13_SEG12COM2_SIZE                           0x1
#define _LCDDATA13_SEG12COM2_LENGTH                         0x1
#define _LCDDATA13_SEG12COM2_MASK                           0x10
#define _LCDDATA13_SEG13COM2_POSN                           0x5
#define _LCDDATA13_SEG13COM2_POSITION                       0x5
#define _LCDDATA13_SEG13COM2_SIZE                           0x1
#define _LCDDATA13_SEG13COM2_LENGTH                         0x1
#define _LCDDATA13_SEG13COM2_MASK                           0x20
#define _LCDDATA13_SEG14COM2_POSN                           0x6
#define _LCDDATA13_SEG14COM2_POSITION                       0x6
#define _LCDDATA13_SEG14COM2_SIZE                           0x1
#define _LCDDATA13_SEG14COM2_LENGTH                         0x1
#define _LCDDATA13_SEG14COM2_MASK                           0x40
#define _LCDDATA13_SEG15COM2_POSN                           0x7
#define _LCDDATA13_SEG15COM2_POSITION                       0x7
#define _LCDDATA13_SEG15COM2_SIZE                           0x1
#define _LCDDATA13_SEG15COM2_LENGTH                         0x1
#define _LCDDATA13_SEG15COM2_MASK                           0x80
#define _LCDDATA13_S08C2_POSN                               0x0
#define _LCDDATA13_S08C2_POSITION                           0x0
#define _LCDDATA13_S08C2_SIZE                               0x1
#define _LCDDATA13_S08C2_LENGTH                             0x1
#define _LCDDATA13_S08C2_MASK                               0x1
#define _LCDDATA13_S09C2_POSN                               0x1
#define _LCDDATA13_S09C2_POSITION                           0x1
#define _LCDDATA13_S09C2_SIZE                               0x1
#define _LCDDATA13_S09C2_LENGTH                             0x1
#define _LCDDATA13_S09C2_MASK                               0x2

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
extern volatile unsigned char           LCDDATA14           __at(0xF73);
#ifndef _LIB_BUILD
asm("LCDDATA14 equ 0F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA14              :8;
    };
    struct {
        unsigned S16C2                  :1;
        unsigned S17C2                  :1;
        unsigned S18C2                  :1;
        unsigned S19C2                  :1;
        unsigned S20C2                  :1;
        unsigned S21C2                  :1;
        unsigned S22C2                  :1;
        unsigned S23C2                  :1;
    };
    struct {
        unsigned SEG16COM2              :1;
        unsigned SEG17COM2              :1;
        unsigned SEG18COM2              :1;
        unsigned SEG19COM2              :1;
        unsigned SEG20COM2              :1;
        unsigned SEG21COM2              :1;
        unsigned SEG22COM2              :1;
        unsigned SEG23COM2              :1;
    };
    struct {
        unsigned MSK0                   :1;
        unsigned MSK1                   :1;
        unsigned MSK2                   :1;
        unsigned MSK3                   :1;
        unsigned MSK4                   :1;
        unsigned MSK5                   :1;
        unsigned MSK6                   :1;
        unsigned MSK7                   :1;
    };
} LCDDATA14bits_t;
